import streamlit as st
import pandas as pd
import numpy as np

# 餐厅数据
restaurants_data = {
    "餐厅": ['星艺荟肯德基', '蛙小侠', '必胜客', '好友缘', '蚂蚁洞'],
    "类型": ['快餐', '中餐', '快餐', '自助餐', '烤肉'],
    "评分": [4.2, 4.5, 4.0, 4.7, 4.3],
    "人均消费(元)": [15, 20, 25, 35, 50],
    "latitude": [22.854016, 22.814051, 22.838049, 22.812196, 22.813766],
    "longitude": [108.222592, 108.321394, 108.262899, 108.397716, 108.385751]
}
#价格数据
Price_data={
    '月份':['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
    '星艺荟肯德基':[58,75,66,69,75,59,77,67,59,68,71,70],
    '蛙小侠':[158,175,166,169,175,159,177,167,159,168,171,170],
    '必胜客':[79,159,136,124,136,79,139,135,149,159,144,156],
    '好友缘':[158,136,159,139,159,144,167,175,158,177,164,158],
    '蚂蚁洞':[188,172,158,167,155,144,159,143,165,135,152,155],
}
#时间数据
time_data={
    '时间':['10:00','11:00','12:00','13:00','14:00','15:00','16:00','17:00','18:00','19:00','20:00','21:00'],
    '星艺荟肯德基':[18,25,36,19,7,5,7,36,29,18,11,8],
    '蛙小侠':[0,17,66,39,15,1,17,67,59,28,11,2],
    '必胜客':[0,15,36,24,36,7,13,15,19,10,14,6],
    '好友缘':[2,36,59,39,19,14,17,55,58,17,16,15],
    '蚂蚁洞':[1,12,28,27,15,14,9,33,45,25,22,15],
}
# 根据上面创建的data，创建数据框
df=pd.DataFrame(restaurants_data)   #餐厅数据
jg=pd.DataFrame(Price_data)         #价格数据
sj=pd.DataFrame(time_data)          #时间数据
#地图
st.header('🌍餐厅位置')  #标题
mp_df=pd.DataFrame(df)   
st.map(mp_df)   #显示地图

st.header('⭐餐厅评分')   #标题
#条形图，定义x轴和y轴
st.bar_chart(df,x='餐厅',y='评分')

st.header('💰餐厅价格')   #标题
#折线图，定义x轴
st.line_chart(jg,x='月份')

st.header('🕚用餐的高峰时段')   #标题
#面积图，定义x轴
st.area_chart(sj,x='时间')
